# TagOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..TagOrientation Property
IndependentTag Class See Also
---
The tag orientation of the tag's head, such as horizontal or vertical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TagOrientation TagOrientation { get; set; }
```

Visual Basic
---
```text
Public Property TagOrientation As TagOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property TagOrientation TagOrientation {
	TagOrientation get ();
	void set (TagOrientation value);
}
```

# Remarks
TagOrientation for the supported orientations. Tags from types that have rotate with component turned on ignore the TagOrientation property. Tags that are not in tag mode ignores the TagOrientation property.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace